app/controllers/helpfiles_controller.rb

  def show
    @helpfile = Helpfile.find(params[:id])
---
SELECT * FROM "helpfiles" WHERE ("helpfiles"."id" = 1)

  def edit
    @helpfile = Helpfile.find(params[:id])
---
SELECT * FROM "helpfiles" WHERE ("helpfiles"."id" = 2)

  def create
    @helpfile = Helpfile.new(params[:helpfile])

    respond_to do |format|
      if @helpfile.save
---
INSERT INTO "helpfiles" ("updated_at", "title", "url", "created_at") VALUES('2009-05-19 21:15:12', 'Event Messages Panel', '/help/EventMessagesPanel.html', '2009-05-19 21:15:12')

  def update
    @helpfile = Helpfile.find(params[:id])

    respond_to do |format|
      if @helpfile.update_attributes(params[:helpfile])
---
SELECT * FROM "helpfiles" WHERE ("helpfiles"."id" = 2)
UPDATE "helpfiles" SET "url" = '/help/webtoolbar.html?Online_Titles.html', "updated_at" = '2009-05-19 21:49:43' WHERE "id" = 2