app/controllers/help_controller.rb

SELECT * FROM "helpfiles" WHERE ("helpfiles"."title" = 'Event Messages Panel') LIMIT 1
---
  def show_help
    help_file = Helpfile.find_by_title(params[:title])