app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('http://localhost:3000/images/k5.jpg', '2009-05-05 16:36:55', 'Product #5', 0.01, 'This is a test product', '2009-05-05 16:36:55')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "description" = '<strong>This is a prototype.</strong>', "updated_at" = '2009-04-25 00:40:22' WHERE "id" = 1